import ChatWidget from '../chat-widget/chat-widget';

const chatsWidgetsData = [
  {
    name: 'Aндрей',
    timestamp: '10:49',
    text: 'Изображение',
    unreads: '4',
  },
  {
    name: 'Киноклуб',
    timestamp: '20:03',
    text: 'Вы: стикер',
  },
  {
    name: 'Задачи на день',
    timestamp: '07:00',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '4',
  },
  {
    name: 'Задачи на день',
    timestamp: 'вт.',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Киноклуб',
    timestamp: '20:03',
    text: 'Вы: стикер',
  },
  {
    name: 'Задачи на день',
    timestamp: '07:00',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '4',
  },
  {
    name: 'Задачи на день',
    timestamp: 'вт.',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
  {
    name: 'Задачи на день',
    timestamp: '12 Aвг 2022',
    text: 'Ниже будет перечень экранов, которые нужно будет нарисовать, а потом реализовать. Обратите внимание, что мы сразу даём имена полей форм и названия некоторых кнопок на этих страницах.',
    unreads: '1',
  },
]

/*
export default {
  chatsWidgets: chatsWidgetsData.map((widget) => new ChatWidget(widget)),
}
*/

export default {
  a: new ChatWidget(chatsWidgetsData[0]),
  b: new ChatWidget(chatsWidgetsData[1]),
  c: new ChatWidget(chatsWidgetsData[2]),
  d: new ChatWidget(chatsWidgetsData[3]),
  e: new ChatWidget(chatsWidgetsData[4]),
  f: new ChatWidget(chatsWidgetsData[5]),
  g: new ChatWidget(chatsWidgetsData[6]),
  h: new ChatWidget(chatsWidgetsData[7]),
  i: new ChatWidget(chatsWidgetsData[8]),
  j: new ChatWidget(chatsWidgetsData[9]),
  k: new ChatWidget(chatsWidgetsData[10]),
  l: new ChatWidget(chatsWidgetsData[11]),
  m: new ChatWidget(chatsWidgetsData[12]),
  n: new ChatWidget(chatsWidgetsData[13]),
  o: new ChatWidget(chatsWidgetsData[14]),
}
